WildernessLabs/Meadow/nuttx/configs/stm32f777zit6-meadow/src/meadow_interrupt.c
/****************************************************************************
 * nuttx\configs\stm32f777zit6-meadow\src\meadow_interrupt.c
 * 
 *   Copyright (C) 2020, 2021, 2023 Wilderness Labs. All rights reserved.
 *   Author:  Wilderness Labs
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * 1. Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 * 2. Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in
 *    the documentation and/or other materials provided with the
 *    distribution.
 * 3. Neither the name NuttX nor the names of its contributors may be
 *    used to endorse or promote products derived from this software
 *    without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
 * "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
 * LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS
 * FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE
 * COPYRIGHT OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
 * BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS
 * OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
 * AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
 * ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE.
 *
 ****************************************************************************/

#warning "(--) Peter working here"

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <string.h>

#include <nuttx/config.h>

#include <nuttx/fs/fs.h>
#include <arch/board/board.h>
#include <nuttx/mqueue.h>
#include <nuttx/signal.h>
#include <nuttx/drivers/pwm.h>
#include <nuttx/spi/spi.h>

#include <stdbool.h>
#include <assert.h>
#include <debug.h>
#include <errno.h>

#include "chip.h"
#include "fcntl.h"
#include "stm32_pwm.h"
#include "stm32_i2c.h"
#include "stm32f777zit6-meadow.h"
#include "stm32_spi.h"

#include <dirent.h>

#include <sys/ioctl.h>
#include <nuttx/timers/timer.h>
#include "stm32_tim.h"

#include <nuttx/clock.h>    // for testing

#include "meadow-upd.h"
#include <meadow/meadow_hw_version.h>

//============================================================
// DEVELOPER NOTE:
// Debounce recognizes the first state transition and then ignores anything
//  after that for a period of time.
// Glitch filtering ignores the first state transition and waits a period of
//  time and then looks at state to make sure the result is stable

// Set > 0 to enable diagnostic output via syslog
#define MEADOW_INTERRUPT_INCLUDE_DIAGNOSTIC_SYSLOG (0)    // 0 > will include

// Arbitrary large value defining the maximum number of gpios that can be
// monitored.
#define MEADOW_INTERRUPT_MAX_SUPPORTED_GPIOS (32)

// A free STM32F7 timer
#define MEADOW_INTERRUPT_STM32F7_TIMER_NUMBER (10)
// #define MEADOW_INTERRUPT_STM32F7_TIMER_NUMBER (14)

// This is a threshold at which any glitch duration greater than this value
// will use milliseconds timing instead of 100 usec timing.
#define MEADOW_INTERRUPT_GLITCH_TIME_USE_MS (200)    // 200 == 20 milliseconds

#if CONFIG_USEC_PER_TICK == 1000
#define MEADOW_INTERRUPT_TICK_MILLISEC_FACTOR (10)
#else
#define MEADOW_INTERRUPT_TICK_MILLISEC_FACTOR (1)
#endif

/****************************************************************************
 * Private Data
 ****************************************************************************/

static bool _firstTimeConfig = true;
static struct stm32_tim_dev_s *_periodicTimer;

// Current GPIO interrupt state
enum MeadowInterruptProcState_e
{
  mint_state_uncfg,           // not configured
  mint_state_wait_gpio_chg,   // waiting for an interrupt from a gpio
  mint_state_mon_glitch,      // gpio is being monitored for glitch timeout
  mint_state_mon_debounce,    // gpio is being monitored for debounce timeout
  mint_state_mon_no_delay     // gpio with no glitch or debounce delay
};

enum RequestedInterruptMode_e
{
  rqstdintmode_none,
  rqstdintmode_rising,
  rqstdintmode_falling,
  rqstdintmode_both
};

enum GlitchDebouceReturnValues_e
{
  glit_debo_ret_check_next_gpio,
  glit_debo_ret_no_timed_remain,
};

// All F7 possible input data registers addresses, used for ISR access to GPIO
// state value.
static uint32_t inputDataRegAddrs[] = 
{
  STM32_GPIOA_IDR,
  STM32_GPIOB_IDR,
  STM32_GPIOC_IDR,
  STM32_GPIOD_IDR,
  STM32_GPIOE_IDR,
  STM32_GPIOF_IDR,
  STM32_GPIOG_IDR,
  STM32_GPIOH_IDR,
  STM32_GPIOI_IDR,
  STM32_GPIOJ_IDR,
  STM32_GPIOK_IDR,
};
#define MEADOW_HW_INPUT_DATA_REGS_TOTAL (sizeof(inputDataRegAddrs) / sizeof(uint32_t))

// The following struct defines the informtion needed for debounce and glitch
// processing
struct interruptPinMap_s
{
  // Represents the CPU Pin identifier (e.g. PD9, D=3 so 39)
  uint8_t PinId;              // Supplied by configuration

  // Address of the "Input Data Register" that holds GPIO port state bits
  uint32_t IDRAddress;        // Calculated during configuration

  // CurrentProcessState - tracks the current processing state for this GPIO
  // defined by an entry in meadowInterruptProcState_e enum
  uint8_t CurrentProcessState;

  // Contains the configured interrupt mode: None = 0, Rising = 1, Falling = 2
  // and Both = 3.
  // Note: for mode 'None' configuration is not sent from Meadow.Core.
  uint8_t GpioInterruptMode;   // Supplied by configuration

  // LastKnownGpioState - Last known GPIO state (often last reported).
  uint8_t LastKnownGpioState;    // 1 = high, 0 = low, 0xff = unknown

  // The number of debounce timer timeouts needed to satisfy user's config
  int32_t DebounceConfiguredDuration;   // Supplied by configuration

  // This counter counts the requested timeouts down to zero, this ends the
  // debounce period allowing new GPIO interrupts to be received and processing
  // to be repeated.
  uint32_t DebounceDownCounter;

