WildernessLabs/Meadow/nuttx/configs/stm32f777zit6-meadow/src/meadow_interrupt.c
  // The number of valid states that must be the same to declare this GPIO's
  //state to be stable.
  uint32_t GlitchConfiguredDuration;   // Supplied by configuration

  // The current number of times the state of the GPIO has been the same
  // without any state transitions.
  uint32_t GlitchTimeoutsCounter;

  // The previous GPIO state that we must be matched to be declared stable
  uint8_t GlitchPrevGpioState;

  // TimeProcessingBegan is used for glitch timing when the glitch duration
  // is beyond a certain limit and for diagnostics.
  uint32_t TimeProcessingBegan;
};

// This is the list of the GPIOs currently being timed. The entries in this
// list are very short lived, begin added as soon as the GPIO ISR is called and
// removed as soon as the glitch or debounce period has elapsed.
static struct interruptPinMap_s * _allGpiosBeingTimed[MEADOW_INTERRUPT_MAX_SUPPORTED_GPIOS];

// Indicates the total number of GPIOs currently being timed.
static volatile int _allGpiosBeingTimedCnt = 0;

// Incremented and decrementd during configuration to indicate how many GPIOs
// need to be timed (only glitch and debounce GPIOs need to be timed).
static volatile int _totalGpiosCanBeTimed = 0;

/****************************************************************************
 * Private Function Prototypes
 ****************************************************************************/

static int mint_isr_gpio_no_delay(int irq, void *context, void *arg);
static int mint_isr_gpio_need_delay(int irq, void *context, void *arg);
static int mint_config_interrupt_prep_timer(int stm32_timer_numb);
static inline int mint_forward_interrupt_to_core(struct interruptPinMap_s *gpioInfoAddr, uint8_t state);
static int mint_process_gpio_debounce(struct interruptPinMap_s *gpioInfoAddr);
static int mint_process_gpio_glitch(struct interruptPinMap_s *gpioInfoAddr);
static int mint_meadow_debounce_notification_logic(struct interruptPinMap_s *gpioInfoAddr);
static inline uint8_t mint_read_current_gpio_state(struct interruptPinMap_s *gpioInfoAddr);
static int mint_isr_periodic(int irq, void *context, void *arg);
static void mint_add_to_timed_list_and_incr(struct interruptPinMap_s *gpioInfoAddr);
static void mint_remove_from_timed_list_and_decr(struct interruptPinMap_s *gpioInfoAddr);

/****************************************************************************
 * Private Functions
 ****************************************************************************/
// This ISR handles the case where a GPIO needs no delay, we notify Meadow.Core
// of the interrupt immediately
int mint_isr_gpio_no_delay(int irq, void *context, void *arg)
{
  struct interruptPinMap_s *gpioInfoAddr = (struct interruptPinMap_s *)arg;

  // Properly setup?
  if(gpioInfoAddr == NULL)
  {
    syslog(LOG_ERR, "%s@%d-gpioInfoAddr == NULL\n", __FILE__, __LINE__);
    return OK;
  }

#if MEADOW_INTERRUPT_INCLUDE_DIAGNOSTIC_SYSLOG > 0
    syslog(LOG_INFO, "mint-(GPIO isr)-0x%02x (P%c%d)- No delay interrupt received, state:%d (5)\n",
            gpioInfoAddr->PinId,
            ((gpioInfoAddr->PinId) >> 4) + 'A', gpioInfoAddr->PinId & 0x0f,
            gpioInfoAddr->CurrentProcessState);
#endif

  if(gpioInfoAddr->CurrentProcessState != mint_state_mon_no_delay)
  {
    syslog(LOG_ERR, "%s@%d-PinId:0x%02x No delay interrupt but not mint_state_mon_no_delay\n",
            __FILE__, __LINE__, gpioInfoAddr->PinId);
    return OK;
  }

  // Configured for neither glitch or debounce delay, so send ASAP.
  uint8_t currentState = mint_read_current_gpio_state(gpioInfoAddr);
  mint_forward_interrupt_to_core(gpioInfoAddr, currentState);

  return OK;
}

//=============================================================================
// This ISR is called for all GPIO state changes for GPIOs needing glitch or
// debounce filtering and a transition of one of those GPIO pins has occurred.
// GPIOs not needing glitch nor debounce filtering use a different ISR.
int mint_isr_gpio_need_delay(int irq, void *context, void *arg)
{  
  struct interruptPinMap_s *gpioInfoAddr = (struct interruptPinMap_s *)arg;

#if MEADOW_INTERRUPT_INCLUDE_DIAGNOSTIC_SYSLOG > 0
  syslog(LOG_INFO, "mint-(GPIO isr)-received interrupt. _totalGpiosCanBeTimed:%d\n", _totalGpiosCanBeTimed);
#endif

  // Is this GPIO setup?
  if(gpioInfoAddr == NULL)
  {
    syslog(LOG_ERR, "%s@%d-gpioInfoAddr == NULL\n",
            __FILE__, __LINE__);
    return OK;
  }

#if MEADOW_INTERRUPT_INCLUDE_DIAGNOSTIC_SYSLOG > 0
    syslog(LOG_INFO, "mint-(GPIO isr)-0x%02x (P%c%d)- received interrupt, with delay\n",
            gpioInfoAddr->PinId,
            ((gpioInfoAddr->PinId) >> 4) + 'A', gpioInfoAddr->PinId & 0x0f);
#endif

  // If not waiting for GPIO state change, ignore. This will be only GPIOs
  // for which glitch and/or debounce timing is actively being timed already.
  if(gpioInfoAddr->CurrentProcessState != mint_state_wait_gpio_chg)
  {
#if MEADOW_INTERRUPT_INCLUDE_DIAGNOSTIC_SYSLOG > 0
    syslog(LOG_INFO, "mint-(GPIO isr)--PinId:0x%02x ignored\n", gpioInfoAddr->PinId);
#endif
    return OK;
  }

  //---------------------------------------------------------------------------
  // The remainder of this code will set things up so this GPIO can be
  // filtered. After being setup this GPIO will be ignored until the glitch /
  // debounce filtering is finished.
  if(gpioInfoAddr->GlitchConfiguredDuration > 0)
  {
    // Setup for ---glitch monitoring---

#if MEADOW_INTERRUPT_INCLUDE_DIAGNOSTIC_SYSLOG > 0
    syslog(LOG_INFO, "mint-(GPIO isr)--PinId:0x%02x, Process glitch\n", gpioInfoAddr->PinId);
#endif

    // If both glitch and debounce configured, glitch always runs before
    // debounce. After the glitch filtering is finished then the debounce
    // filtering will begin.
    gpioInfoAddr->GlitchTimeoutsCounter = 0;
    gpioInfoAddr->CurrentProcessState = mint_state_mon_glitch;

    mint_add_to_timed_list_and_incr(gpioInfoAddr);

    // Start timer if not running
    STM32_TIM_SETMODE(_periodicTimer, STM32_TIM_MODE_UP);
  }
  else if(gpioInfoAddr->DebounceConfiguredDuration > 0)
  {
    // Setup for ---debounce monitoring---
    
#if MEADOW_INTERRUPT_INCLUDE_DIAGNOSTIC_SYSLOG > 0
    syslog(LOG_INFO, "mint-(GPIO isr)--PinId:0x%02x, Process debounce\n", gpioInfoAddr->PinId);
#endif

