WildernessLabs/Meadow/nuttx/configs/stm32f777zit6-meadow/src/meadow_interrupt.c
  // Find the entry specified
  for(activeOffset = 0; activeOffset < MEADOW_INTERRUPT_MAX_SUPPORTED_GPIOS; activeOffset++)
  {
    if(_allGpiosBeingTimed[activeOffset] == gpioInfoAddr)
      break;
  }

  // Was the item in the list?
  if(activeOffset == MEADOW_INTERRUPT_MAX_SUPPORTED_GPIOS)
    return;  // Not found

  // Keep tally of entries
  _allGpiosBeingTimedCnt--;

  // Is this the only entry?
  if(activeOffset == _allGpiosBeingTimedCnt)
  {
    // Remove the last entry in the array
    _allGpiosBeingTimed[activeOffset] = NULL;
    return;
  }
 
  // Compress the list by moving the last entry in the list to the slot we
  // are about to remove and then clearing the last slot.
  _allGpiosBeingTimed[activeOffset] = _allGpiosBeingTimed[_allGpiosBeingTimedCnt];
  _allGpiosBeingTimed[_allGpiosBeingTimedCnt] = NULL;
  return;
}

//=============================================================================
// Timer settup is here. This should only be called once to prepare timer for
// for periodic operation.
static int mint_config_interrupt_prep_timer(int stm32_timer_numb)
{
  int ret;
  struct stm32_tim_dev_s *initTimer;

  // For 100 microsec
  // (--) pwm this should be related to STM32_APB2_TIM10_CLKIN and
  // not hardcoded!!!!!
  uint32_t frequency = 1920000;
  uint32_t period = 192 - 1;
  xcpt_t isrHandler = mint_isr_periodic;

  // For future reference
  // -- for 1 microsec --
  // frequency = STM32_APB2_TIM10_CLKIN;
  // period = 192 - 1;
  // -- for 1 millisec --
  // frequency = STM32_APB2_TIM10_CLKIN / 100; // = 1,920,000 MHz
  // period = 1920 - 1;                        // = 1 millisec
  
  initTimer = stm32_tim_init(stm32_timer_numb);
  if(initTimer == NULL)
  {
    syslog(LOG_ERR, "%s@%d-stm32_tim_init returned NULL\n",
          __FILE__, __LINE__);
    return OK;
  }
  
  // This determines the prescaler value 0 - 65535. Nuttx looks up the
  // desired frequency and calculates the correct clock divisor.
  STM32_TIM_SETCLOCK(initTimer, frequency);

  // Increasing period decreases the frequency
  // Sets the Auto Reload Register value
  STM32_TIM_SETPERIOD(initTimer, period);

  // arg (third parameter) is a pointer that's returned in the isr handler
  ret = STM32_TIM_SETISR(initTimer, isrHandler, NULL, 0);
  if(ret < 0)
  {
    syslog(LOG_ERR, "%s@%d-STM32_TIM_SETISR failed:%d\n",
          __FILE__, __LINE__, ret);
    return ret;
  }

  // Prevent interrupts until needed
  STM32_TIM_SETMODE(initTimer, STM32_TIM_MODE_DISABLED);

  // Finish set up
  STM32_TIM_ACKINT(initTimer, GTIM_SR_UIF);
  STM32_TIM_ENABLEINT(initTimer, GTIM_DIER_UIE);

  _periodicTimer = initTimer;
  return OK;
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/
// Called from meadow-upd.c to configure or remove a gpio for monitoring
int mint_config_interrupt(struct mint_gpio_int_config* cfg)
{
  int ret;
  struct interruptPinMap_s *gpioInfoAddr;
  uint8_t pinDesignation = cfg->port << 4 | cfg->pin;

  if(cfg->risingEdge == 0 && cfg->fallingEdge == 0)
  {
    return -EINVAL;
  }

  if(_firstTimeConfig)
  {
    _allGpiosBeingTimedCnt = 0;
    _firstTimeConfig = false;

    // Setup the timer once, the first time
    ret = mint_config_interrupt_prep_timer(MEADOW_INTERRUPT_STM32F7_TIMER_NUMBER);
    if(ret < 0)
    {
      syslog(LOG_ERR, "mint-(cfg)---mint_config_interrupt_prep_timer failed\n");
      return ret;
    }
  }

  // Allocate memory for this GPIO's configuration and data storage needs
  gpioInfoAddr = (struct interruptPinMap_s *) zalloc(sizeof (struct interruptPinMap_s));
  if(gpioInfoAddr == NULL)
  {
    syslog(LOG_ERR, "%s@%d-malloc returned NULL\n", __FILE__, __LINE__);
    return -ENOMEM;
  }

  // We must set a few elements in the struct for this configuration
  gpioInfoAddr->PinId = pinDesignation;

  // Find the correct offset for this GPIO
  gpioInfoAddr->IDRAddress = inputDataRegAddrs[cfg->port];
  gpioInfoAddr->CurrentProcessState = mint_state_uncfg;
  gpioInfoAddr->LastKnownGpioState = 0xff;

  if(cfg->enable)
  {
    // Get the current GPIO state which may be used when processing
    // interrupts
    gpioInfoAddr->LastKnownGpioState = mint_read_current_gpio_state(gpioInfoAddr);
    gpioInfoAddr->GlitchPrevGpioState = gpioInfoAddr->LastKnownGpioState;

    // Note: the available configurations are 0.0 (none), 0.1 - 1000 millisec.
    // Foundation.Core will supply a value of 0, 1 - 10000. Since the timer 
    // is set at 100 usec then the count provided is the same as the number
    // of timer timeouts received.

    // Set both Debounce and Glitch delay times
    gpioInfoAddr->DebounceConfiguredDuration = cfg->debounceDuration;
    gpioInfoAddr->GlitchConfiguredDuration = cfg->glitchDuration;      
    gpioInfoAddr->GlitchTimeoutsCounter = 0;

    // none = 0, rising = 1, falling = 2 & both = 3 (must match F7GPIOManager_interrupts.cs
    // in WireInterrupt()
    gpioInfoAddr->GpioInterruptMode = (cfg->risingEdge & 0x01) | (cfg->fallingEdge & 0x01) << 1;

    // cfgset contains 20-bits of data. It is required by the Nuttx stm32_gpiosetevent
    // function. If the 20 bits of data are not correct, this Nuttx function will
    // reconfigure the GPIO based on whatever the data is in cfgset.
    // See stm32_gpio.h for more information.
    // Inputs: MMUU .... ...X PPPP BBBB
    // MM = Mode for input (this is 00)
    // UU = pull up, pull down or float
    // X  = is external interrupt selection, stm32_gpiosetevent sets this
    uint32_t cfgset = (pinDesignation & 0x000000ff);   // Set Port and Pin and clear MM

    switch(cfg->resistorMode)
    {
      case 0: // Float
        cfgset |= GPIO_FLOAT;
        break;    // 0 = do nothing
      case 1: // Pull up
        cfgset |= GPIO_PULLUP;
        break;
      case 2: // Pull down
        cfgset |= GPIO_PULLDOWN;
        break;
    }

#if MEADOW_INTERRUPT_INCLUDE_DIAGNOSTIC_SYSLOG > 0
    syslog(LOG_INFO, "mint-(cfg)- 0x%02x (P%c%d)-Cfg Enabled-LKS:%d, GLDuration:%d, DBDuration:%d, InterruptMode:%d, cfgset:0x%08x\n",
              gpioInfoAddr->PinId,
              ((gpioInfoAddr->PinId) >> 4) + 'A', gpioInfoAddr->PinId & 0x0f,
              gpioInfoAddr->LastKnownGpioState,
              gpioInfoAddr->GlitchConfiguredDuration,
              gpioInfoAddr->DebounceConfiguredDuration,
              gpioInfoAddr->GpioInterruptMode,
              cfgset);
#endif

    // Tell Nuttx about interrupt parameters
    if(gpioInfoAddr->GlitchConfiguredDuration > 0)
    {
      // For Glitch we must receive both rising and falling or we cannot keep
      // LastKnownGpioState accurate. After a stable state is reached we save
      // this value. Without this we couldn't send rising and falling correctly
      // to Meadow.Core
      ret = stm32_gpiosetevent(
      cfgset,                     // Nuttx cfgset
      1,                          // risingEdge,
      1,                          // fallingEdge,
      0,                          // event
      mint_isr_gpio_need_delay,   // Need delay GPIO ISR
      gpioInfoAddr);              // GPIO information address

      // If not already configured
      if(gpioInfoAddr->CurrentProcessState == mint_state_uncfg)
          _totalGpiosCanBeTimed++;

      gpioInfoAddr->CurrentProcessState = mint_state_wait_gpio_chg;
    }
    else if(gpioInfoAddr->DebounceConfiguredDuration > 0)
    {
      // For Debounce we cannot know the GPIOs state for certain when we receive
      // the interrupt notification, so we rely on the MCU only sending interrupts
      // based on the rising and falling configuration. For Both (rising and falling)
      // we assume that the state is the opposite of the last know state.
      ret = stm32_gpiosetevent(
      cfgset,                     // Nuttx cfgset
      cfg->risingEdge,            // risingEdge,
      cfg->fallingEdge,           // fallingEdge,
      0,                          // event
      mint_isr_gpio_need_delay,   // Need delay GPIO ISR
      gpioInfoAddr);              // GPIO information address

      // If not already configured
      if(gpioInfoAddr->CurrentProcessState == mint_state_uncfg)
          _totalGpiosCanBeTimed++;

      gpioInfoAddr->CurrentProcessState = mint_state_wait_gpio_chg;
    }
    else
    {
#if MEADOW_INTERRUPT_INCLUDE_DIAGNOSTIC_SYSLOG > 0
      syslog(LOG_INFO, "udp-(cfg)-0x%02x (P%c%d)--Config NO delay Interrupt\n", gpioInfoAddr->PinId,
                  ((gpioInfoAddr->PinId) >> 4) + 'A', gpioInfoAddr->PinId & 0x0f);
#endif

      // Configured with neither debounch nor glitch filtering.
      // For no delay, as above, we cannot know the GPIOs state for certain when we
      // receive the interrupt notification. So, we immediately read the state.
      // and hope for the best.
      ret = stm32_gpiosetevent(
      cfgset,                   // Nuttx cfgset
      cfg->risingEdge,          // risingEdge,
      cfg->fallingEdge,         // fallingEdge,
      0,                        // event
      mint_isr_gpio_no_delay,   // No delay GPIO ISR
      gpioInfoAddr);            // GPIO information address

      gpioInfoAddr->CurrentProcessState = mint_state_mon_no_delay;
    }
  }
  else
  {
    // Requested to remove a GPIO from being monitored
#if MEADOW_INTERRUPT_INCLUDE_DIAGNOSTIC_SYSLOG > 0
    syslog(LOG_INFO, "udp-(cfg)-0x%02x (P%c%d)--Removing GPIO\n", gpioInfoAddr->PinId,
                ((gpioInfoAddr->PinId) >> 4) + 'A', gpioInfoAddr->PinId & 0x0f);
#endif

    // Small chance but it might be actively timing
    mint_remove_from_timed_list_and_decr(gpioInfoAddr);

    // Tell Nuttx to forget about this interrupt
    ret = stm32_gpiosetevent(gpioInfoAddr->PinId, 0, 0, 0, NULL, NULL);

    if(gpioInfoAddr->CurrentProcessState != mint_state_mon_no_delay)
      _totalGpiosCanBeTimed--;   // Keep track only of timed gpios

    gpioInfoAddr->CurrentProcessState = mint_state_uncfg;

    free(gpioInfoAddr);
  }

  return ret;
}
